Revit 2026 API

# ViewCanCategoryBeHidden Method

---

Checks whether the category can be hidden in the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanCategoryBeHidden(
	ElementId elementId
)
```
```vb
Public Function CanCategoryBeHidden (
	elementId As ElementId
) As Boolean
```
```cpp
public:
bool CanCategoryBeHidden(
	ElementId^ elementId
)
```
```fsharp
member CanCategoryBeHidden :
        elementId : ElementId -> bool
```

#### Parameters

elementId ElementId
     ElementId of the category.

#### Return Value

Boolean True if the category can be hidden, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Categories can be allowed to be hidden in some view types and prohibited from being hidden in others. E.g., categories cannot be hidden in ProjectBrowser

#### Reference

View Class

Autodesk.Revit.DB Namespace